backend: tensorflow
class_name: Model
config:
  input_layers:
  - [data_freq_time, 0, 0]
  - [data_dm_time, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 256, 256, 1]
      dtype: float32
      name: data_freq_time
      sparse: false
    inbound_nodes: []
    name: data_freq_time
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 256, 256, 1]
      dtype: float32
      name: data_dm_time
      sparse: false
    inbound_nodes: []
    name: data_dm_time
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 3
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id002 !!python/tuple [2, 2]
      name: conv2d_1__0
      padding: valid
      strides: &id003 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - data_freq_time
        - 0
        - 0
        - {}
    name: conv2d_1__0
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 3
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id002
      name: conv2d_2__1
      padding: valid
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - data_dm_time
        - 0
        - 0
        - {}
    name: conv2d_2__1
  - class_name: Model
    config:
      input_layers:
      - [input_2, 0, 0]
      layers:
      - class_name: InputLayer
        config:
          batch_input_shape: !!python/tuple [null, null, null, 3]
          dtype: float32
          name: input_2
          sparse: false
        inbound_nodes: []
        name: input_2
      - class_name: ZeroPadding2D
        config:
          data_format: channels_last
          name: zero_padding2d_1
          padding: !!python/tuple
          - !!python/tuple [3, 3]
          - !!python/tuple [3, 3]
          trainable: &id004 !!python/object/apply:numpy.core.multiarray.scalar
          - &id103 !!python/object/apply:numpy.dtype
            args: [b1, 0, 1]
            state: !!python/tuple [3, '|', null, null, null, -1, -1, 0]
          - !!binary |
            AA==
        inbound_nodes:
        - - - input_2
            - 0
            - 0
            - {}
        name: zero_padding2d_1
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 64
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [7, 7]
          name: conv1/conv
          padding: valid
          strides: !!python/tuple [2, 2]
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - zero_padding2d_1
            - 0
            - 0
            - {}
        name: conv1/conv
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv1/bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - conv1/conv
            - 0
            - 0
            - {}
        name: conv1/bn
      - class_name: Activation
        config:
          activation: relu
          name: conv1/relu
          trainable: *id004
        inbound_nodes:
        - - - conv1/bn
            - 0
            - 0
            - {}
        name: conv1/relu
      - class_name: ZeroPadding2D
        config:
          data_format: channels_last
          name: zero_padding2d_2
          padding: !!python/tuple
          - !!python/tuple [1, 1]
          - !!python/tuple [1, 1]
          trainable: *id004
        inbound_nodes:
        - - - conv1/relu
            - 0
            - 0
            - {}
        name: zero_padding2d_2
      - class_name: MaxPooling2D
        config:
          data_format: channels_last
          name: pool1
          padding: valid
          pool_size: !!python/tuple [3, 3]
          strides: !!python/tuple [2, 2]
          trainable: *id004
        inbound_nodes:
        - - - zero_padding2d_2
            - 0
            - 0
            - {}
        name: pool1
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv2_block1_0_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - pool1
            - 0
            - 0
            - {}
        name: conv2_block1_0_bn
      - class_name: Activation
        config:
          activation: relu
          name: conv2_block1_0_relu
          trainable: *id004
        inbound_nodes:
        - - - conv2_block1_0_bn
            - 0
            - 0
            - {}
        name: conv2_block1_0_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 128
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [1, 1]
          name: conv2_block1_1_conv
          padding: valid
          strides: &id005 !!python/tuple [1, 1]
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - conv2_block1_0_relu
            - 0
            - 0
            - {}
        name: conv2_block1_1_conv
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv2_block1_1_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - conv2_block1_1_conv
            - 0
            - 0
            - {}
        name: conv2_block1_1_bn
      - class_name: Activation
        config:
          activation: relu
          name: conv2_block1_1_relu
          trainable: *id004
        inbound_nodes:
        - - - conv2_block1_1_bn
            - 0
            - 0
            - {}
        name: conv2_block1_1_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 32
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: conv2_block1_2_conv
          padding: same
          strides: *id005
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - conv2_block1_1_relu
            - 0
            - 0
            - {}
        name: conv2_block1_2_conv
      - class_name: Concatenate
        config:
          axis: 3
          name: conv2_block1_concat
          trainable: *id004
        inbound_nodes:
        - - - pool1
            - 0
            - 0
            - &id006 {}
          - - conv2_block1_2_conv
            - 0
            - 0
            - *id006
        name: conv2_block1_concat
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv2_block2_0_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - conv2_block1_concat
            - 0
            - 0
            - {}
        name: conv2_block2_0_bn
      - class_name: Activation
        config:
          activation: relu
          name: conv2_block2_0_relu
          trainable: *id004
        inbound_nodes:
        - - - conv2_block2_0_bn
            - 0
            - 0
            - {}
        name: conv2_block2_0_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 128
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [1, 1]
          name: conv2_block2_1_conv
          padding: valid
          strides: *id005
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - conv2_block2_0_relu
            - 0
            - 0
            - {}
        name: conv2_block2_1_conv
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv2_block2_1_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - conv2_block2_1_conv
            - 0
            - 0
            - {}
        name: conv2_block2_1_bn
      - class_name: Activation
        config:
          activation: relu
          name: conv2_block2_1_relu
          trainable: *id004
        inbound_nodes:
        - - - conv2_block2_1_bn
            - 0
            - 0
            - {}
        name: conv2_block2_1_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 32
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: conv2_block2_2_conv
          padding: same
          strides: *id005
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - conv2_block2_1_relu
            - 0
            - 0
            - {}
        name: conv2_block2_2_conv
      - class_name: Concatenate
        config:
          axis: 3
          name: conv2_block2_concat
          trainable: *id004
        inbound_nodes:
        - - - conv2_block1_concat
            - 0
            - 0
            - &id007 {}
          - - conv2_block2_2_conv
            - 0
            - 0
            - *id007
        name: conv2_block2_concat
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv2_block3_0_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - conv2_block2_concat
            - 0
            - 0
            - {}
        name: conv2_block3_0_bn
      - class_name: Activation
        config:
          activation: relu
          name: conv2_block3_0_relu
          trainable: *id004
        inbound_nodes:
        - - - conv2_block3_0_bn
            - 0
            - 0
            - {}
        name: conv2_block3_0_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 128
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [1, 1]
          name: conv2_block3_1_conv
          padding: valid
          strides: *id005
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - conv2_block3_0_relu
            - 0
            - 0
            - {}
        name: conv2_block3_1_conv
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv2_block3_1_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - conv2_block3_1_conv
            - 0
            - 0
            - {}
        name: conv2_block3_1_bn
      - class_name: Activation
        config:
          activation: relu
          name: conv2_block3_1_relu
          trainable: *id004
        inbound_nodes:
        - - - conv2_block3_1_bn
            - 0
            - 0
            - {}
        name: conv2_block3_1_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 32
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: conv2_block3_2_conv
          padding: same
          strides: *id005
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - conv2_block3_1_relu
            - 0
            - 0
            - {}
        name: conv2_block3_2_conv
      - class_name: Concatenate
        config:
          axis: 3
          name: conv2_block3_concat
          trainable: *id004
        inbound_nodes:
        - - - conv2_block2_concat
            - 0
            - 0
            - &id008 {}
          - - conv2_block3_2_conv
            - 0
            - 0
            - *id008
        name: conv2_block3_concat
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv2_block4_0_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - conv2_block3_concat
            - 0
            - 0
            - {}
        name: conv2_block4_0_bn
      - class_name: Activation
        config:
          activation: relu
          name: conv2_block4_0_relu
          trainable: *id004
        inbound_nodes:
        - - - conv2_block4_0_bn
            - 0
            - 0
            - {}
        name: conv2_block4_0_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 128
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [1, 1]
          name: conv2_block4_1_conv
          padding: valid
          strides: *id005
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - conv2_block4_0_relu
            - 0
            - 0
            - {}
        name: conv2_block4_1_conv
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv2_block4_1_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - conv2_block4_1_conv
            - 0
            - 0
            - {}
        name: conv2_block4_1_bn
      - class_name: Activation
        config:
          activation: relu
          name: conv2_block4_1_relu
          trainable: *id004
        inbound_nodes:
        - - - conv2_block4_1_bn
            - 0
            - 0
            - {}
        name: conv2_block4_1_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 32
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: conv2_block4_2_conv
          padding: same
          strides: *id005
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - conv2_block4_1_relu
            - 0
            - 0
            - {}
        name: conv2_block4_2_conv
      - class_name: Concatenate
        config:
          axis: 3
          name: conv2_block4_concat
          trainable: *id004
        inbound_nodes:
        - - - conv2_block3_concat
            - 0
            - 0
            - &id009 {}
          - - conv2_block4_2_conv
            - 0
            - 0
            - *id009
        name: conv2_block4_concat
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv2_block5_0_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - conv2_block4_concat
            - 0
            - 0
            - {}
        name: conv2_block5_0_bn
      - class_name: Activation
        config:
          activation: relu
          name: conv2_block5_0_relu
          trainable: *id004
        inbound_nodes:
        - - - conv2_block5_0_bn
            - 0
            - 0
            - {}
        name: conv2_block5_0_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 128
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [1, 1]
          name: conv2_block5_1_conv
          padding: valid
          strides: *id005
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - conv2_block5_0_relu
            - 0
            - 0
            - {}
        name: conv2_block5_1_conv
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv2_block5_1_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - conv2_block5_1_conv
            - 0
            - 0
            - {}
        name: conv2_block5_1_bn
      - class_name: Activation
        config:
          activation: relu
          name: conv2_block5_1_relu
          trainable: *id004
        inbound_nodes:
        - - - conv2_block5_1_bn
            - 0
            - 0
            - {}
        name: conv2_block5_1_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 32
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: conv2_block5_2_conv
          padding: same
          strides: *id005
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - conv2_block5_1_relu
            - 0
            - 0
            - {}
        name: conv2_block5_2_conv
      - class_name: Concatenate
        config:
          axis: 3
          name: conv2_block5_concat
          trainable: *id004
        inbound_nodes:
        - - - conv2_block4_concat
            - 0
            - 0
            - &id010 {}
          - - conv2_block5_2_conv
            - 0
            - 0
            - *id010
        name: conv2_block5_concat
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv2_block6_0_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - conv2_block5_concat
            - 0
            - 0
            - {}
        name: conv2_block6_0_bn
      - class_name: Activation
        config:
          activation: relu
          name: conv2_block6_0_relu
          trainable: *id004
        inbound_nodes:
        - - - conv2_block6_0_bn
            - 0
            - 0
            - {}
        name: conv2_block6_0_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 128
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [1, 1]
          name: conv2_block6_1_conv
          padding: valid
          strides: *id005
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - conv2_block6_0_relu
            - 0
            - 0
            - {}
        name: conv2_block6_1_conv
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv2_block6_1_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - conv2_block6_1_conv
            - 0
            - 0
            - {}
        name: conv2_block6_1_bn
      - class_name: Activation
        config:
          activation: relu
          name: conv2_block6_1_relu
          trainable: *id004
        inbound_nodes:
        - - - conv2_block6_1_bn
            - 0
            - 0
            - {}
        name: conv2_block6_1_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 32
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: conv2_block6_2_conv
          padding: same
          strides: *id005
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - conv2_block6_1_relu
            - 0
            - 0
            - {}
        name: conv2_block6_2_conv
      - class_name: Concatenate
        config:
          axis: 3
          name: conv2_block6_concat
          trainable: *id004
        inbound_nodes:
        - - - conv2_block5_concat
            - 0
            - 0
            - &id011 {}
          - - conv2_block6_2_conv
            - 0
            - 0
            - *id011
        name: conv2_block6_concat
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: pool2_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - conv2_block6_concat
            - 0
            - 0
            - {}
        name: pool2_bn
      - class_name: Activation
        config:
          activation: relu
          name: pool2_relu
          trainable: *id004
        inbound_nodes:
        - - - pool2_bn
            - 0
            - 0
            - {}
        name: pool2_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 128
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [1, 1]
          name: pool2_conv
          padding: valid
          strides: *id005
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - pool2_relu
            - 0
            - 0
            - {}
        name: pool2_conv
      - class_name: AveragePooling2D
        config:
          data_format: channels_last
          name: pool2_pool
          padding: valid
          pool_size: !!python/tuple [2, 2]
          strides: !!python/tuple [2, 2]
          trainable: *id004
        inbound_nodes:
        - - - pool2_conv
            - 0
            - 0
            - {}
        name: pool2_pool
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv3_block1_0_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - pool2_pool
            - 0
            - 0
            - {}
        name: conv3_block1_0_bn
      - class_name: Activation
        config:
          activation: relu
          name: conv3_block1_0_relu
          trainable: *id004
        inbound_nodes:
        - - - conv3_block1_0_bn
            - 0
            - 0
            - {}
        name: conv3_block1_0_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 128
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [1, 1]
          name: conv3_block1_1_conv
          padding: valid
          strides: *id005
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - conv3_block1_0_relu
            - 0
            - 0
            - {}
        name: conv3_block1_1_conv
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv3_block1_1_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - conv3_block1_1_conv
            - 0
            - 0
            - {}
        name: conv3_block1_1_bn
      - class_name: Activation
        config:
          activation: relu
          name: conv3_block1_1_relu
          trainable: *id004
        inbound_nodes:
        - - - conv3_block1_1_bn
            - 0
            - 0
            - {}
        name: conv3_block1_1_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 32
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: conv3_block1_2_conv
          padding: same
          strides: *id005
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - conv3_block1_1_relu
            - 0
            - 0
            - {}
        name: conv3_block1_2_conv
      - class_name: Concatenate
        config:
          axis: 3
          name: conv3_block1_concat
          trainable: *id004
        inbound_nodes:
        - - - pool2_pool
            - 0
            - 0
            - &id012 {}
          - - conv3_block1_2_conv
            - 0
            - 0
            - *id012
        name: conv3_block1_concat
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv3_block2_0_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - conv3_block1_concat
            - 0
            - 0
            - {}
        name: conv3_block2_0_bn
      - class_name: Activation
        config:
          activation: relu
          name: conv3_block2_0_relu
          trainable: *id004
        inbound_nodes:
        - - - conv3_block2_0_bn
            - 0
            - 0
            - {}
        name: conv3_block2_0_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 128
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [1, 1]
          name: conv3_block2_1_conv
          padding: valid
          strides: *id005
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - conv3_block2_0_relu
            - 0
            - 0
            - {}
        name: conv3_block2_1_conv
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv3_block2_1_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - conv3_block2_1_conv
            - 0
            - 0
            - {}
        name: conv3_block2_1_bn
      - class_name: Activation
        config:
          activation: relu
          name: conv3_block2_1_relu
          trainable: *id004
        inbound_nodes:
        - - - conv3_block2_1_bn
            - 0
            - 0
            - {}
        name: conv3_block2_1_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 32
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: conv3_block2_2_conv
          padding: same
          strides: *id005
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - conv3_block2_1_relu
            - 0
            - 0
            - {}
        name: conv3_block2_2_conv
      - class_name: Concatenate
        config:
          axis: 3
          name: conv3_block2_concat
          trainable: *id004
        inbound_nodes:
        - - - conv3_block1_concat
            - 0
            - 0
            - &id013 {}
          - - conv3_block2_2_conv
            - 0
            - 0
            - *id013
        name: conv3_block2_concat
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv3_block3_0_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - conv3_block2_concat
            - 0
            - 0
            - {}
        name: conv3_block3_0_bn
      - class_name: Activation
        config:
          activation: relu
          name: conv3_block3_0_relu
          trainable: *id004
        inbound_nodes:
        - - - conv3_block3_0_bn
            - 0
            - 0
            - {}
        name: conv3_block3_0_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 128
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [1, 1]
          name: conv3_block3_1_conv
          padding: valid
          strides: *id005
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - conv3_block3_0_relu
            - 0
            - 0
            - {}
        name: conv3_block3_1_conv
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv3_block3_1_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - conv3_block3_1_conv
            - 0
            - 0
            - {}
        name: conv3_block3_1_bn
      - class_name: Activation
        config:
          activation: relu
          name: conv3_block3_1_relu
          trainable: *id004
        inbound_nodes:
        - - - conv3_block3_1_bn
            - 0
            - 0
            - {}
        name: conv3_block3_1_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 32
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: conv3_block3_2_conv
          padding: same
          strides: *id005
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - conv3_block3_1_relu
            - 0
            - 0
            - {}
        name: conv3_block3_2_conv
      - class_name: Concatenate
        config:
          axis: 3
          name: conv3_block3_concat
          trainable: *id004
        inbound_nodes:
        - - - conv3_block2_concat
            - 0
            - 0
            - &id014 {}
          - - conv3_block3_2_conv
            - 0
            - 0
            - *id014
        name: conv3_block3_concat
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.99
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: conv3_block4_0_bn
          scale: true
          trainable: *id004
        inbound_nodes:
        - - - conv3_block3_concat
            - 0
            - 0
            - {}
        name: conv3_block4_0_bn
      - class_name: Activation
        config:
          activation: relu
          name: conv3_block4_0_relu
          trainable: *id004
        inbound_nodes:
        - - - conv3_block4_0_bn
            - 0
            - 0
            - {}
        name: conv3_block4_0_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          filters: 128
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [1, 1]
          name: conv3_block4_1_conv
          padding: valid
          strides: *id005
          trainable: *id004
          use_bias: false
        inbound_nodes:
        - - - conv3_block4_0_relu
            - 0
            - 0
            - {}
        name: conv3_block4_1_conv
      - class_name: BatchNormalization
        config:
          axis: 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          epsilon: 1.001e-05
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
